app/controllers/tasks_controller.rb

  def create
    @task = current_user.tasks.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`user_id`, `name`, `status`, `created_at`, `updated_at`) VALUES (4, 'qwer', 'in_progress', '2021-03-01 11:34:07.532811', '2021-03-01 11:34:07.532811')

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE `tasks` SET `tasks`.`updated_at` = '2021-03-01 10:42:54.726487', `tasks`.`status` = 'backlog' WHERE `tasks`.`id` = 3

    def set_task
      @task = current_user.tasks.find(params[:id])
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`user_id` = 4 AND `tasks`.`id` = 1 LIMIT 1